In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Titanic Dataset.csv")

print("Dataset Loaded Successfully!\n")

Dataset Loaded Successfully!

In [ ]:
print("First 5 Rows:")
print(df.head())

print("\nDataset Information:")
df.info()

print("\nStatistical Summary:")
print(df.describe())

First 5 Rows:
   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.00      0      0   24160  211.3375       B5        S    2    NaN
1   0.92      1      2  113781  151.5500  C22 C26        S   11    NaN
2   2.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN
3  30.00      1      2  113781  151.5500  C22 C26        S  NaN  135.0
4  25.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

Dataset Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

Statistical Summary:
            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881138     0.498854     0.385027
std       0.837836     0.486055    14.413493     1.041658     0.865560
min       1.000000     0.000000     0.170000     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

              fare        body
count  1308.000000  121.000000
mean     33.295479  160.809917
std      51.758668   97.696922
min       0.000000    1.000000
25%       7.895800   72.000000
50%      14.454200  155.000000
75%      31.275000  256.000000
max     512.329200  328.000000

In [8]:
print("\nMissing Values Before Cleaning:")
print(df.isnull().sum())
df['age'].fillna(df['age'].mean(), inplace=True)
if 'cabin' in df.columns.str.lower():
    df.drop('cabin', axis=1, inplace=True)
print("\nMissing Values After Cleaning:")
print(df.isnull().sum())

Missing Values Before Cleaning:
pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

Missing Values After Cleaning:
pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

/tmp/ipython-input-2770168176.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(), inplace=True)

In [14]:
age_series = df['age']
fare_series = df['fare']
survival_series = df['survived']
print("\nage Series Sample:")
print(age_series.head())

age Series Sample:
0    29.00
1     0.92
2     2.00
3    30.00
4    25.00
Name: age, dtype: float64

In [16]:
print("\nPassenger using loc (index 5):")
print(df.loc[5])

print("\nPassenger using iloc (index 10):")
print(df.iloc[10])

print("\nSelected Columns (age, fare, survived):")
print(df[['age', 'fare', 'survived']].head())

Passenger using loc (index 5):
pclass                         1
survived                       1
name         Anderson, Mr. Harry
sex                         male
age                         48.0
sibsp                          0
parch                          0
ticket                     19952
fare                       26.55
embarked                       S
boat                           3
body                         NaN
home.dest           New York, NY
Name: 5, dtype: object

Passenger using iloc (index 10):
pclass                            1
survived                          0
name         Astor, Col. John Jacob
sex                            male
age                            47.0
sibsp                             1
parch                             0
ticket                     PC 17757
fare                        227.525
embarked                          C
boat                            NaN
body                          124.0
home.dest              New York, NY
Name: 10, dtype: object

Selected Columns (age, fare, survived):
     age      fare  survived
0  29.00  211.3375         1
1   0.92  151.5500         1
2   2.00  151.5500         0
3  30.00  151.5500         0
4  25.00  151.5500         0

In [33]:
df.rename(columns={'Sex': 'Gender'}, inplace=True)
print("\nColumn 'Sex' renamed to 'Gender'")

Column 'Sex' renamed to 'Gender'

In [21]:
print("\nPassengers with age > 30:")
print(df[df['age'] > 30].head())

print("\nPassengers with fare > 50:")
print(df[df['fare'] > 50].head())

print("\nFemale Passengers Who survived:")
print(df[(df['sex'] == 'Female') & (df['survived'] == 1)].head())

Passengers with age > 30:
   pclass  survived                                           name     sex  \
5       1         1                            Anderson, Mr. Harry    male
6       1         1              Andrews, Miss. Kornelia Theodosia  female
7       1         0                         Andrews, Mr. Thomas Jr    male
8       1         1  Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9       1         0                        Artagaveytia, Mr. Ramon    male

    age  sibsp  parch    ticket     fare embarked boat  body  \
5  48.0      0      0     19952  26.5500        S    3   NaN
6  63.0      1      0     13502  77.9583        S   10   NaN
7  39.0      0      0    112050   0.0000        S  NaN   NaN
8  53.0      2      0     11769  51.4792        S    D   NaN
9  71.0      0      0  PC 17609  49.5042        C  NaN  22.0

             home.dest
5         New York, NY
6           Hudson, NY
7          Belfast, NI
8  Bayside, Queens, NY
9  Montevideo, Uruguay

Passengers with fare > 50:
   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare embarked boat   body  \
0  29.00      0      0   24160  211.3375        S    2    NaN
1   0.92      1      2  113781  151.5500        S   11    NaN
2   2.00      1      2  113781  151.5500        S  NaN    NaN
3  30.00      1      2  113781  151.5500        S  NaN  135.0
4  25.00      1      2  113781  151.5500        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

Female Passengers Who survived:
Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, embarked, boat, body, home.dest]
Index: []

In [22]:
print("\nTop 5 Highest fare:")
print(df.sort_values(by='fare', ascending=False).head())

print("\nYoungest Passengers:")
print(df.sort_values(by='age').head())

Top 5 Highest fare:
     pclass  survived                                               name  \
302       1         1                                   Ward, Miss. Anna
49        1         1                 Cardeza, Mr. Thomas Drake Martinez
50        1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
183       1         1                             Lesurer, Mr. Gustave J
116       1         1                Fortune, Mrs. Mark (Mary McDougald)

        sex   age  sibsp  parch    ticket      fare embarked boat  body  \
302  female  35.0      0      0  PC 17755  512.3292        C    3   NaN
49     male  36.0      0      1  PC 17755  512.3292        C    3   NaN
50   female  58.0      0      1  PC 17755  512.3292        C    3   NaN
183    male  35.0      0      0  PC 17755  512.3292        C    3   NaN
116  female  60.0      1      4     19950  263.0000        S   10   NaN

                                          home.dest
302                                             NaN
49   Austria-Hungary / Germantown, Philadelphia, PA
50                     Germantown, Philadelphia, PA
183                                             NaN
116                                    Winnipeg, MB

Youngest Passengers:
      pclass  survived                                     name     sex   age  \
763        3         1  Dean, Miss. Elizabeth Gladys "Millvina"  female  0.17
747        3         0  Danbom, Master. Gilbert Sigvard Emanuel    male  0.33
1240       3         1          Thomas, Master. Assad Alexander    male  0.42
427        2         1                Hamalainen, Master. Viljo    male  0.67
657        3         1                   Baclini, Miss. Eugenie  female  0.75

      sibsp  parch     ticket     fare embarked boat  body  \
763       1      2  C.A. 2315  20.5750        S   10   NaN
747       0      2     347080  14.4000        S  NaN   NaN
1240      0      1       2625   8.5167        C   16   NaN
427       1      1     250649  14.5000        S    4   NaN
657       2      1       2666  19.2583        C    C   NaN

                       home.dest
763   Devon, England Wichita, KS
747                  Stanton, IA
1240                         NaN
427                  Detroit, MI
657           Syria New York, NY

In [26]:
print("\nSurvival Rate by sex:")
print(df.groupby('sex')['survived'].mean())

print("\nAverage age by Passenger Class:")
print(df.groupby('pclass')['age'].mean())

print("\nSurvival Count by embarked:")
print(df.groupby('embarked')['survived'].sum())

Survival Rate by sex:
sex
female    0.727468
male      0.190985
Name: survived, dtype: float64

Average age by Passenger Class:
pclass
1    38.039580
2    29.528333
3    26.302224
Name: age, dtype: float64

Survival Count by embarked:
embarked
C    150
Q     44
S    304
Name: survived, dtype: int64

In [29]:
class_info = pd.DataFrame({
    'pclass': [1, 2, 3],
    'Class_Category': ['Upper', 'Middle', 'Lower']})

merged_df = pd.merge(df, class_info, on='pclass')

print("\nMerged Data Sample:")
print(merged_df.head())

Merged Data Sample:
   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare embarked boat   body  \
0  29.00      0      0   24160  211.3375        S    2    NaN
1   0.92      1      2  113781  151.5500        S   11    NaN
2   2.00      1      2  113781  151.5500        S  NaN    NaN
3  30.00      1      2  113781  151.5500        S  NaN  135.0
4  25.00      1      2  113781  151.5500        S  NaN    NaN

                         home.dest Class_Category
0                     St Louis, MO          Upper
1  Montreal, PQ / Chesterville, ON          Upper
2  Montreal, PQ / Chesterville, ON          Upper
3  Montreal, PQ / Chesterville, ON          Upper
4  Montreal, PQ / Chesterville, ON          Upper

In [32]:
print("\nAverage age (survived vs Not survived):")
print(df.groupby('survived')['age'].mean())

print("\nHighest fare Paid:", df['fare'].max())
print("Lowest fare Paid:", df['fare'].min())

survival_percentage = df['survived'].mean() * 100
print("\nOverall Survival Percentage: {:.2f}%".format(survival_percentage))

print("\nProject Completed Successfully!")

Average age (survived vs Not survived):
survived
0    30.389365
1    29.058826
Name: age, dtype: float64

Highest fare Paid: 512.3292
Lowest fare Paid: 0.0

Overall Survival Percentage: 38.20%

Project Completed Successfully!